input layer: [1,64,64,3] 
    >64 becomes 56 because we used a kernel size of 9 and the image will be shrunk by 9-1 = 8 pixels
    >256 are the filters

conv1 layer: [1, 56, 56, 256]
    > 56 becomes 24 because we used a kernel size of 9, like last time it will be shrunk by 8 pixels, but this time because we used a stride of 2 it will be divided by 2.
    (56-8)/2 = 24
    >256 is the number of filters (we chose 256 because it was used in Hinton's paper)

primary conv2 layer: [1, 24, 24, 256]
    >since we want 8D vectors we can reshape the output of the previous layer to (1, 24, 24, 32, 8) by splitting 256 to 32 x 8
    but because this layer will be fully connected to the next capsule layer we can just flatten the 24x24 grids. this means we can just reshape to (1, (24*24*32), 8) = (1, 18432, 8)

primary squash
    >the vectors are squashed 

digitcaps 
    >3 is the number of classes
    >16 is hardcoded, based on Hinton's paper. 

mask layer
    > The true label is used to mask the output of capsule layer. For training OR Mask using the capsule with maximal length. For prediction

***capsnet lenght and decoder



==================================================================================================
input_1 (InputLayer)            [(1, 64, 64, 3)]    0
__________________________________________________________________________________________________
conv1 (Conv2D)                  (1, 56, 56, 256)    62464       input_1[0][0]
__________________________________________________________________________________________________
primarycap_conv2d (Conv2D)      (1, 24, 24, 256)    5308672     conv1[0][0]
__________________________________________________________________________________________________
primarycap_reshape (Reshape)    (1, 18432, 8)       0           primarycap_conv2d[0][0]
__________________________________________________________________________________________________
primarycap_squash (Lambda)      (1, 18432, 8)       0           primarycap_reshape[0][0]
__________________________________________________________________________________________________
digitcaps (CapsuleLayer)        (1, 3, 16)          7077888     primarycap_squash[0][0]
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
mask (Mask)                     (1, 48)             0           digitcaps[0][0]
                                                                 input_2[0][0]
__________________________________________________________________________________________________
capsnet (Length)                (1, 3)              0           digitcaps[0][0]
__________________________________________________________________________________________________
decoder (Sequential)            (None, 64, 64, 3)    13145600    mask[0][0]
==================================================================================================
Total params: 25,594,624
Trainable params: 25,594,624
Non-trainable params: 0

Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(20, 32, 32, 3)]    0
__________________________________________________________________________________________________
conv1 (Conv2D)                  (20, 24, 24, 64)     15616       input_1[0][0]
__________________________________________________________________________________________________
primarycap_conv2d (Conv2D)      (20, 8, 8, 64)       331840      conv1[0][0]
__________________________________________________________________________________________________
primarycap_reshape (Reshape)    (20, 512, 8)         0           primarycap_conv2d[0][0]
__________________________________________________________________________________________________
primarycap_squash (Lambda)      (20, 512, 8)         0           primarycap_reshape[0][0]
__________________________________________________________________________________________________
digitcaps (CapsuleLayer)        (20, 3, 16)          196608      primarycap_squash[0][0]
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
mask (Mask)                     (20, 48)             0           digitcaps[0][0]
                                                                 input_2[0][0]
__________________________________________________________________________________________________
capsnet (Length)                (20, 3)              0           digitcaps[0][0]
__________________________________________________________________________________________________
decoder (Sequential)            (None, 32, 32, 3)    3702785     mask[0][0]
==================================================================================================
Total params: 4,246,849
Trainable params: 4,246,849
Non-trainable params: 0
__________________________________________________________________________________________________